storage/tests/d1741884-edc6-4d56-90f2-8ac6ccec2910/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/d1741884-edc6-4d56-90f2-8ac6ccec2910/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 35s max duration (incl. graceful stop):
              * default: 5 looping VUs for 5s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  1.0s/5s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  2.0s/5s

running (03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  3.0s/5s

running (04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  4.0s/5s

running (05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  5.0s/5s

running (06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (11.0s), 3/5 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (12.0s), 2/5 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (13.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s


  █ TOTAL RESULTS 

    checks_total.......: 25     1.911024/s
    checks_succeeded...: 80.00% 20 out of 25
    checks_failed......: 20.00% 5 out of 25

    ✗ status ok
      ↳  80% — ✓ 20 / ✗ 5

    HTTP
    http_req_duration..............: avg=156.08ms min=3.55ms med=7.96ms max=606.82ms p(90)=390.25ms p(95)=407.21ms
      { expected_response:true }...: avg=93.15ms  min=3.55ms med=7.37ms max=410.51ms p(90)=385.58ms p(95)=394.82ms
    http_req_failed................: 20.00% 5 out of 25
    http_reqs......................: 25     1.911024/s

    EXECUTION
    iteration_duration.............: avg=11.51s   min=10.38s med=11.01s max=13.08s   p(90)=12.85s   p(95)=12.96s  
    iterations.....................: 5      0.382205/s
    vus............................: 1      min=1       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 19 kB  1.4 kB/s
    data_sent......................: 7.5 kB 572 B/s



running (13.1s), 0/5 VUs, 5 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  5s